{
    "statech.tip.steam_drill": "The Steam Mining Drill will automatically refill itself with water if you have a water bucket in your inventory.",
    "statech.tip.batch_craft": "It's better to batch craft items rather than crafting them one by one.",
    "statech.tip.tfmg": "The Factory Must Grow",
    "statech.tip.oregen": "Ores in StaTech Industry generate in large deposits. Check for small stones on the surface, or use the Prospectors Pick.",
    "statech.tip.fluid_power": "It is more efficient to route Steam in fluid pipes around your base than power cables",
    "statech.tip.smart_chute": "The Create Smart Chute can be used to send an exact amount of items into an inventory. Very useful in automating the Large Steam Macerator",
    "statech.tip.machine_volumes": "You can adjust the overall volumes of machines by adjusting the Blocks slider in the volume control. You can mute individual machines using a Steel Mallet.",
    "statech.tip.ae2_fluid_substitute": "You can enable Fluid Substition in the AE2 Pattern Terminal to easily automate recipes that require a bucket of fluid",
    "statech.tip.osha": "OSHA does not exist in StaTech Industry",
    "statech.tip.slime_sling_glider": "The Slime Sling and Glider make a fantastic traversal method for the early game",
    "statech.tip.mi_pipes": "You can shift+right click pipes and cables to place them facing into the machine you're looking at. It doesn't consume the pipe if there's already one next to it.",
    "statech.tip.tool_leveling": "The Tool Leveling table is an endgame block in Spectrum progression that allows you to pay materials to increase enchantment levels beyond their usual maximum caps.",
    "statech.tip.distillation_tower": "You will need at least six Distillation Towers to passively automate Shale Oil processing",
    "statech.tip.recipe_tick": "Machines can overclock to a maximum of one recipe per tick. If you need faster processing, consider the large variants of machines.",
    "statech.tip.water_dupe": "The water dupe will not be patched.",
    "statech.tip.steam_blast_furnace": "All recipes that can be used in the Steam Blast Furnace can also be used in the Electric Blast Furnace, with the benefit of being able to overclock.",
    "statech.tip.automatic_trashcan": "The Automatic Trashcan will delete any items or fluids piped into it. You can also click over fluids in machines with the item selected to delete them."
}